"""
!curl https://full-stack-bigdata-datasets.s3.eu-west-3.amazonaws.com/Machine+Learning+non+Supervis%C3%A9/Projects/uber-trip-data.zip --output uber.zip
!unzip uber.zip
!rm uber.zip

In [ ]:
#!rm uber-trip-data/uber-raw-data-janjune-15.csv.zip

In [2]:
import pandas as pd

In [3]:
df_april = pd.read_csv("uber-trip-data/uber-raw-data-apr14.csv")

In [4]:
df_august = pd.read_csv("uber-trip-data/uber-raw-data-aug14.csv")

In [5]:
df_July = pd.read_csv("uber-trip-data/uber-raw-data-jul14.csv")

In [6]:
df_jun = pd.read_csv("uber-trip-data/uber-raw-data-jun14.csv")

In [7]:
df_may = pd.read_csv("uber-trip-data/uber-raw-data-may14.csv")

In [8]:
df_september = pd.read_csv("uber-trip-data/uber-raw-data-sep14.csv")

In [9]:
df = pd.concat([df_april, df_august, df_July, df_jun,df_may,df_september], ignore_index=True) # ==> Concaténer les différents dataset en 1
print("Done")

Done

In [10]:
df.head()

          Date/Time      Lat      Lon    Base
0  4/1/2014 0:11:00  40.7690 -73.9549  B02512
1  4/1/2014 0:17:00  40.7267 -74.0345  B02512
2  4/1/2014 0:21:00  40.7316 -73.9873  B02512
3  4/1/2014 0:28:00  40.7588 -73.9776  B02512
4  4/1/2014 0:33:00  40.7594 -73.9722  B02512

In [11]:
df.describe()

                Lat           Lon
count  4.534327e+06  4.534327e+06
mean   4.073926e+01 -7.397302e+01
std    3.994991e-02  5.726670e-02
min    3.965690e+01 -7.492900e+01
25%    4.072110e+01 -7.399650e+01
50%    4.074220e+01 -7.398340e+01
75%    4.076100e+01 -7.396530e+01
max    4.211660e+01 -7.206660e+01

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4534327 entries, 0 to 4534326
Data columns (total 4 columns):
 #   Column     Dtype
---  ------     -----
 0   Date/Time  object
 1   Lat        float64
 2   Lon        float64
 3   Base       object
dtypes: float64(2), object(2)
memory usage: 138.4+ MB

In [13]:
display(100*df.isnull().sum()/df.shape[0])

Date/Time    0.0
Lat          0.0
Lon          0.0
Base         0.0
dtype: float64

In [14]:
df['Date/Time'] = pd.to_datetime(df['Date/Time'])
df["day"] = df['Date/Time'].dt.day
df["hour"] = df['Date/Time'].dt.hour
df["month"] = df['Date/Time'].dt.month
df["weekofyear"] = df['Date/Time'].dt.weekofyear
df["dayofweek"] = df['Date/Time'].dt.dayofweek
df.head()

<ipython-input-14-98594db2b950>:5: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  df["weekofyear"] = df['Date/Time'].dt.weekofyear

,Date/Time,Lat,Lon,Base,day,hour,month,weekofyear,dayofweek
0,2014-04-01 00:11:00,40.7690,-73.9549,B02512,1,0,4,14,1
1,2014-04-01 00:17:00,40.7267,-74.0345,B02512,1,0,4,14,1
2,2014-04-01 00:21:00,40.7316,-73.9873,B02512,1,0,4,14,1
3,2014-04-01 00:28:00,40.7588,-73.9776,B02512,1,0,4,14,1
4,2014-04-01 00:33:00,40.7594,-73.9722,B02512,1,0,4,14,1

In [15]:
#df = df.drop("Date/Time", axis=1)

In [16]:
df.head()

,Date/Time,Lat,Lon,Base,day,hour,month,weekofyear,dayofweek
0,2014-04-01 00:11:00,40.7690,-73.9549,B02512,1,0,4,14,1
1,2014-04-01 00:17:00,40.7267,-74.0345,B02512,1,0,4,14,1
2,2014-04-01 00:21:00,40.7316,-73.9873,B02512,1,0,4,14,1
3,2014-04-01 00:28:00,40.7588,-73.9776,B02512,1,0,4,14,1
4,2014-04-01 00:33:00,40.7594,-73.9722,B02512,1,0,4,14,1

In [17]:
set(df["month"])

{4, 5, 6, 7, 8, 9}

In [18]:
mask = (df["day"]==7) & (df["month"]==7) & (df["hour"]==18)

In [19]:
mask.sum()

1274

In [20]:
mask.shape

(4534327,)

In [21]:
df_mask = df.loc[mask,:]
df_mask = df_mask.reset_index(drop = True)
df_mask.head()

,Date/Time,Lat,Lon,Base,day,hour,month,weekofyear,dayofweek
0,2014-07-07 18:00:00,40.7767,-73.9571,B02512,7,18,7,28,0
1,2014-07-07 18:01:00,40.7829,-73.9794,B02512,7,18,7,28,0
2,2014-07-07 18:02:00,40.6807,-73.9833,B02512,7,18,7,28,0
3,2014-07-07 18:04:00,40.7331,-73.9899,B02512,7,18,7,28,0
4,2014-07-07 18:05:00,40.6465,-73.7897,B02512,7,18,7,28,0

In [22]:
df_mask.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1274 entries, 0 to 1273
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date/Time   1274 non-null   datetime64[ns]
 1   Lat         1274 non-null   float64
 2   Lon         1274 non-null   float64
 3   Base        1274 non-null   object
 4   day         1274 non-null   int64
 5   hour        1274 non-null   int64
 6   month       1274 non-null   int64
 7   weekofyear  1274 non-null   int64
 8   dayofweek   1274 non-null   int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(1)
memory usage: 89.7+ KB

In [23]:
#set(df["day"])

In [24]:
set(df_mask["dayofweek"])

{0}

In [25]:
#set(df_mask["Lat"])

In [26]:
X = df_mask.drop(["Date/Time", "Base"], axis=1)

In [27]:
set(X["dayofweek"])

{0}

In [28]:
# Using the Elbow method to find the optimal number K of clusters
from sklearn.cluster import KMeans
wcss =  []
for i in range (1,11): 
    kmeans = KMeans(n_clusters= i, init = "k-means++", random_state = 0)
    kmeans.fit(X)
    wcss.append(kmeans.inertia_)

In [29]:
!pip install plotly -q

In [30]:
wcss

[5.320580246036095,
 2.921845636190089,
 2.0946402050965807,
 1.5337360802225901,
 1.1097090771322278,
 0.8670311115951348,
 0.7384866811974877,
 0.625898007442645,
 0.542265696423851,
 0.47652729203879207]

In [31]:
import plotly.io as pio
pio.renderers.default = "iframe"

In [32]:
# Create a DataFrame that will be fed to plotly 
wcss_frame = pd.DataFrame(wcss)

# Using Plotly to visualize elbow 
import plotly.express as px 
import seaborn as sns

# Creating a line plot
fig = px.line(wcss_frame, x=wcss_frame.index, y=wcss_frame.iloc[:, -1])

# Creating layouts 
fig.update_layout(
    title="Inertia per clusters",
    xaxis_title="# clusters",
    yaxis_title="Inertia"
)

# Render in notebook
fig.show()

In [33]:
# Import silhouette score
from sklearn.metrics import silhouette_score

# Computer mean silhouette score
sil = []

## Careful, you need to start at i=2 as silhouette score cannot accept less than 2 labels 
for i in range (2,11): 
    kmeans = KMeans(n_clusters= i, init = "k-means++", random_state = 0)
    kmeans.fit(X)
    sil.append(silhouette_score(X, kmeans.predict(X)))
    print("Silhouette score for K={} is {}".format(i, sil[-1]))

Silhouette score for K=2 is 0.7442656045565526
Silhouette score for K=3 is 0.41223149759680555
Silhouette score for K=4 is 0.4219849724676883
Silhouette score for K=5 is 0.4639615293943694
Silhouette score for K=6 is 0.47208630112659206
Silhouette score for K=7 is 0.4717322385630167
Silhouette score for K=8 is 0.4526046793768077
Silhouette score for K=9 is 0.4804977314707293
Silhouette score for K=10 is 0.4694933790705377

In [34]:
# Create a data frame 
cluster_scores=pd.DataFrame(sil, index=range(2,11))

# Create figure
fig = px.bar(data_frame=cluster_scores,  
             x=cluster_scores.index, 
             y=cluster_scores.iloc[:, -1]
            )

# Add title and axis labels
fig.update_layout(
    yaxis_title="Silhouette Score",
    xaxis_title="# Clusters",
    title="Silhouette Score per cluster"
)

# Render
fig.show()
# fig.show(renderer="iframe") if using workspace

In [35]:
# Applying KMeans to the Mall dataset

kmeans = KMeans(n_clusters= 5, init= "k-means++", max_iter=300, n_init = 10, random_state=0)
y_kmeans = kmeans.fit_predict(X)

In [36]:
X["cluster"] = kmeans.labels_

In [37]:
set(kmeans.labels_)

{0, 1, 2, 3, 4}

In [38]:
X.head()

       Lat      Lon  day  hour  month  weekofyear  dayofweek  cluster
0  40.7767 -73.9571    7    18      7          28          0        0
1  40.7829 -73.9794    7    18      7          28          0        0
2  40.6807 -73.9833    7    18      7          28          0        2
3  40.7331 -73.9899    7    18      7          28          0        2
4  40.6465 -73.7897    7    18      7          28          0        1

In [39]:
#data_sample_viz = data_sample[data_sample[‘cluster’] != -1]
fig = px.scatter_mapbox(data_frame=X, lat="Lat", lon="Lon", mapbox_style="open-street-map",color="cluster")
fig.show()

In [40]:
#data_sample_viz = data_sample[data_sample[‘cluster’] != -1]
fig = px.scatter_mapbox(data_frame=X, lat="Lat", lon="Lon", animation_frame="cluster", mapbox_style="open-street-map",color="cluster")
fig.show()

In [41]:
mask_3_days = (df["day"]<=3) & (df["month"]==7)

In [42]:
mask_3_days = df.loc[mask_3_days,:]

In [43]:
mask_3_days["dayofweek"].unique()

array([1, 2, 3])

In [44]:
mask_3_days.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69305 entries, 1393791 to 2182170
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date/Time   69305 non-null  datetime64[ns]
 1   Lat         69305 non-null  float64
 2   Lon         69305 non-null  float64
 3   Base        69305 non-null  object
 4   day         69305 non-null  int64
 5   hour        69305 non-null  int64
 6   month       69305 non-null  int64
 7   weekofyear  69305 non-null  int64
 8   dayofweek   69305 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(1)
memory usage: 5.3+ MB

In [45]:
mask_3_days.head()

,Date/Time,Lat,Lon,Base,day,hour,month,weekofyear,dayofweek
1393791,2014-07-01 00:03:00,40.7586,-73.9706,B02512,1,0,7,27,1
1393792,2014-07-01 00:05:00,40.7605,-73.9994,B02512,1,0,7,27,1
1393793,2014-07-01 00:06:00,40.7320,-73.9999,B02512,1,0,7,27,1
1393794,2014-07-01 00:09:00,40.7635,-73.9793,B02512,1,0,7,27,1
1393795,2014-07-01 00:20:00,40.7204,-74.0047,B02512,1,0,7,27,1

In [46]:
set(mask_3_days["day"])

{1, 2, 3}

In [47]:
mask_3_days = mask_3_days.drop(["Date/Time", "Base"], axis=1)

In [48]:
mask_3_days.head()

             Lat      Lon  day  hour  month  weekofyear  dayofweek
1393791  40.7586 -73.9706    1     0      7          27          1
1393792  40.7605 -73.9994    1     0      7          27          1
1393793  40.7320 -73.9999    1     0      7          27          1
1393794  40.7635 -73.9793    1     0      7          27          1
1393795  40.7204 -74.0047    1     0      7          27          1

In [49]:
# Using Plotly to visualize elbow 
import plotly.express as px 
import seaborn as sns
import plotly.io as pio
pio.renderers.default = "iframe"
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score

In [50]:
# initialize list of lists
Cluster_per_month = [['April', 3], ['May', 5], ['Jun', 5], ['July', 5], ['August', 5], ['September', 5]]
 
# Create the pandas DataFrame
Cluster_per_month = pd.DataFrame(Cluster_per_month, columns = ['Months', 'Cluster'])
 
# print dataframe.
Cluster_per_month

      Months  Cluster
0      April        3
1        May        5
2        Jun        5
3       July        5
4     August        5
5  September        5

In [51]:
X2 = df.drop(["Date/Time", "Base"],axis=1)
Mask_X2 = (df["month"]==4) & (df["day"]==1)
X2 = X2.loc[Mask_X2,:]

In [52]:
X3_GPS = df.drop(["Date/Time", "Base","day","month","hour","weekofyear","dayofweek"],axis=1)
Mask_X3_GPS = (df["month"]==4) & (df["day"]==1)
X3_GPS = X3_GPS.loc[Mask_X3_GPS,:]

In [53]:
X3_GPS.head()

       Lat      Lon
0  40.7690 -73.9549
1  40.7267 -74.0345
2  40.7316 -73.9873
3  40.7588 -73.9776
4  40.7594 -73.9722

In [54]:
X2.head()

       Lat      Lon  day  hour  month  weekofyear  dayofweek
0  40.7690 -73.9549    1     0      4          14          1
1  40.7267 -74.0345    1     0      4          14          1
2  40.7316 -73.9873    1     0      4          14          1
3  40.7588 -73.9776    1     0      4          14          1
4  40.7594 -73.9722    1     0      4          14          1

In [55]:
set(X2["month"])

{4}

In [56]:
kmeans2 = KMeans(n_clusters= 5, init= "k-means++", max_iter=300, n_init = 10, random_state=0)
y_kmeans2 = kmeans2.fit_predict(df.loc[df["weekofyear"]==14,["Lat", "Lon"]])

kmeans3 = KMeans(n_clusters= 5, init= "k-means++", max_iter=300, n_init = 10, random_state=0)
X3_GPS["cluster3"]= kmeans3.fit_predict(X3_GPS)

In [57]:
set(kmeans2.labels_)

{0, 1, 2, 3, 4}

In [58]:
df_kmeans2 = pd.DataFrame(kmeans2.labels_)

In [59]:
df_kmeans2.value_counts()

1    56107
4    48996
0     3781
2     2594
3      923
dtype: int64

X2["cluster2"] = kmeans2.labels_
X2 = X2.sort_values(by=['cluster2'])

X3_GPS.head()

set(X3_GPS["cluster3"])

In [60]:
X_week4 = df.loc[df["weekofyear"]==14]
X_week4["cluster_week14"] = kmeans2.labels_

<ipython-input-60-4bf6f7dc3e3d>:2: SettingWithCopyWarning:


A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [61]:
kmeans2 = KMeans(n_clusters= 5, init= "k-means++", max_iter=300, n_init = 10, random_state=0)
y_kmeans2 = kmeans2.fit_predict(df.loc[df["weekofyear"]==14,["Lat", "Lon"]])

df_kmeans2 = pd.DataFrame(kmeans2.labels_)
print(df_kmeans2.value_counts())

X_week14 = df.loc[df["weekofyear"]==14].copy()
X_week14["cluster_week14"] = kmeans2.labels_

fig = px.scatter_mapbox(data_frame=X_week14, lat="Lat", lon="Lon",animation_frame="dayofweek", mapbox_style="open-street-map",color="cluster_week14")
fig.show()

1    56107
4    48996
0     3781
2     2594
3      923
dtype: int64

In [62]:
kmeans3 = KMeans(n_clusters= 5, init= "k-means++", max_iter=300, n_init = 10, random_state=0)
y_kmeans3 = kmeans3.fit_predict(df.loc[:,["Lat", "Lon"]])

#df_kmeans3 = pd.DataFrame(kmeans3.labels_)
#print(df_kmeans3.value_counts())

X_all_month = df.copy()
X_all_month["X_all_month"] = kmeans3.labels_

In [63]:
X_all_month = X_all_month.sort_values(by=["weekofyear"])
fig = px.scatter_mapbox(data_frame=X_all_month, lat="Lat", lon="Lon",animation_frame="weekofyear", mapbox_style="open-street-map",color="X_all_month")
fig.show()

In [64]:
print(len(X_all_month["X_all_month"]))

4534327

In [65]:
from sklearn.cluster import KMeans

In [66]:
kmeans = KMeans(n_clusters= 5, init= "k-means++", max_iter=300, n_init = 10, random_state=0)
y_kmeans = kmeans.fit_predict(df.loc[df["month"]==4,["Lat", "Lon"]])

#df_kmeans3 = pd.DataFrame(kmeans3.labels_)
#print(df_kmeans3.value_counts())

X_April = df.loc[df["month"]==4].copy()
X_April["X_April"] = kmeans.labels_

In [67]:
X_all_month = X_all_month.sort_values(by=["dayofweek"])
fig = px.scatter_mapbox(data_frame=X_April, lat="Lat", lon="Lon",animation_frame="dayofweek", mapbox_style="open-street-map",color="X_April")
fig.show()

In [68]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4534327 entries, 0 to 4534326
Data columns (total 9 columns):
 #   Column      Dtype
---  ------      -----
 0   Date/Time   datetime64[ns]
 1   Lat         float64
 2   Lon         float64
 3   Base        object
 4   day         int64
 5   hour        int64
 6   month       int64
 7   weekofyear  int64
 8   dayofweek   int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(1)
memory usage: 311.3+ MB

In [69]:
df_april_sample = df.loc[df["month"]==4,:].sample(10000)

In [70]:
from sklearn.cluster import DBSCAN
import numpy as np
# Instanciate DBSCAN with manhattan distance 
db = DBSCAN(eps=0.02, min_samples=60, metric="manhattan")
y_db = db.fit_predict(df_april_sample[["Lat", "Lon"]])

df_april_sample["Cluster April"] = y_db

In [71]:
import plotly.express as px

In [72]:
fig = px.scatter_mapbox(data_frame=df_april_sample.sort_values("dayofweek"), lat="Lat", lon="Lon",animation_frame="dayofweek", mapbox_style="open-street-map",color="Cluster April")
fig.show()

In [73]:
df_weekofyear_26 = df.loc[df["weekofyear"]==26].sample(10000)

In [74]:
df_weekofyear_26.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10000 entries, 2413433 to 2415294
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Date/Time   10000 non-null  datetime64[ns]
 1   Lat         10000 non-null  float64
 2   Lon         10000 non-null  float64
 3   Base        10000 non-null  object
 4   day         10000 non-null  int64
 5   hour        10000 non-null  int64
 6   month       10000 non-null  int64
 7   weekofyear  10000 non-null  int64
 8   dayofweek   10000 non-null  int64
dtypes: datetime64[ns](1), float64(2), int64(5), object(1)
memory usage: 781.2+ KB

In [75]:
from sklearn.cluster import DBSCAN
import numpy as np
# Instanciate DBSCAN with manhattan distance 
db = DBSCAN(eps=0.02, min_samples=60, metric="manhattan")
y_db = db.fit_predict(df_weekofyear_26[["Lat", "Lon"]])

df_weekofyear_26["df_weekofyear_26"] = y_db

In [76]:
fig1 = px.scatter_mapbox(data_frame=df_weekofyear_26.sort_values("dayofweek"), lat="Lat", lon="Lon",animation_frame="dayofweek", mapbox_style="open-street-map",color="df_weekofyear_26")
fig1.show()
fig2 = px.scatter_mapbox(data_frame=df_weekofyear_26.sort_values("hour"), lat="Lat", lon="Lon",animation_frame="hour", mapbox_style="open-street-map",color="df_weekofyear_26")
fig2.show()

In [77]:
"""
make it clean !!!

Notre modèle corobore la réalité. Il est donc pertinent par rapport aux informtions disponibles.

"""

'\nmake it clean !!!\n\nNotre modèle corobore la réalité. Il est donc pertinent par rapport aux informtions disponibles.\n\n'